#include <stdio.h>

int main() {
    int n;

    // Введення n
    printf("Введіть n (n > 2): ");
    scanf("%d", &n);

    if (n <= 2) {
        printf("Введіть коректне значення n (n > 2)\n");
        return 1; // Вихід з програми з помилкою
    }

    int x[n]; // Масив для збереження значень x₀, x₁, ..., xₙ
    x[0] = x[1] = x[2] = 2; // Початкові значення

    for (int i = 3; i <= n; ++i) {
        x[i] = x[i - 1] + 4 / x[i - 3];
    }

    // Виведення результату
    printf("%d-й член послідовності: %d\n", n, x[n]);

    return 0;
}
