#include <stdio.h>
#include <stdlib.h>

int main() {
    double *ptr1, *ptr2;

    // Виділення пам'яті для першого покажчика
    ptr1 = (double *)malloc(sizeof(double));

    if (ptr1 == NULL) {
        printf("Помилка виділення пам'яті.\n");
        return 1; // Вихід з програми з помилкою
    }

    // Виділення пам'яті для другого покажчика
    ptr2 = (double *)malloc(sizeof(double));

    if (ptr2 == NULL) {
        free(ptr1); // Звільнення пам'яті, щоб уникнути витоку пам'яті
        printf("Помилка виділення пам'яті.\n");
        return 1; // Вихід з програми з помилкою
    }

    // Введення значень з клавіатури
    printf("Введіть значення для першого покажчика: ");
    scanf("%lf", ptr1);

    printf("Введіть значення для другого покажчика: ");
    scanf("%lf", ptr2);

    // Збільшення першого значення вдвічі
    *ptr1 *= 2;

    // Виведення результату
    printf("Перше значення після збільшення вдвічі: %lf\n", *ptr1);
    printf("Друге значення: %lf\n", *ptr2);

    // Звільнення виділеної пам'яті
    free(ptr1);
    free(ptr2);

    return 0;
}
