#include <stdio.h>

int main() {
    int n;

    // Введення значення n з клавіатури
    printf("Введіть натуральне число n (4 < n < 10): ");
    scanf("%d", &n);

    // Перевірка умов на введене значення n
    if (n <= 4 || n >= 10) {
        printf("Введене значення n не задовольняє умові (4 < n < 10).\n");
        return 1;  // Повертаємо код помилки
    }

    // Оголошення масиву для зберігання n натуральних чисел
    int a[n];

    // Введення n натуральних чисел з клавіатури
    printf("Введіть %d натуральних чисел:\n", n);
    for (int i = 0; i < n; ++i) {
        printf("a%d: ", i + 1);
        scanf("%d", &a[i]);
    }

    // Обчислення суми чисел
    int sum = 0;
    for (int i = 0; i < n; ++i) {
        sum += a[i];
    }

    // Обчислення та виведення результату
    int result = 2 * sum * sum;
    printf("Результат: %d\n", result);

    return 0;
}
